Ran Plan for project: `homeassistant` dir: `repositories/homeassistant` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.github_repository.github_repository.repo: Refreshing state... [id=homeassistant]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github_repository.github_repository.repo has been deleted
- resource "github_repository" "repo" {
      - allow_auto_merge       = false -> null
      - allow_merge_commit     = false -> null
      - allow_rebase_merge     = false -> null
      - allow_squash_merge     = true -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - branches               = [
          - {
              - name      = "main"
              - protected = false
            },
          - {
              - name      = "remove-deprecations"
              - protected = false
            },
        ] -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = true -> null
      - description            = "My personal Home Assistant config" -> null
      - etag                   = "W/\"bced4ebcfc19e842427040f2a08e668f951847f070bb9f42d65b66450320efd1\"" -> null
      - full_name              = "glitchcrab/homeassistant" -> null
      - git_clone_url          = "git://github.com/glitchcrab/homeassistant.git" -> null
      - has_downloads          = true -> null
      - has_issues             = true -> null
      - has_projects           = true -> null
      - has_wiki               = true -> null
      - html_url               = "https://github.com/glitchcrab/homeassistant" -> null
      - http_clone_url         = "https://github.com/glitchcrab/homeassistant.git" -> null
      - id                     = "homeassistant" -> null
      - is_template            = false -> null
      - name                   = "homeassistant" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnkxMDEyNzEyNDM=" -> null
      - private                = false -> null
      - repo_id                = 101271243 -> null
      - ssh_clone_url          = "git@github.com:glitchcrab/homeassistant.git" -> null
      - svn_url                = "https://github.com/glitchcrab/homeassistant" -> null
      - topics                 = [] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.github_repository.github_repository.repo will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "My personal Home Assistant config"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "homeassistant"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "home-assistant",
          + "home-assistant-config",
          + "home-automation",
          + "homeassistant",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p homeassistant`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=glitchcrab%252Fgithub-repo-management%252Frepositories%252Fhomeassistant%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p homeassistant`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
